[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
、
て
た
の
か
い
と
に
は
し
っ
な
。
を
る
う
も
れ
ら
こ
あ
そ
ま
す
り
ん
く
…
「
」
さ
け
よ
き
え
お
つ
女
わ
彼
ち
や
め
せ
ー
人
ろ
―
ふ
一
ね
ス
ン
ひ
へ
言
子
見
み
分
出
自
ル
思
ゃ
リ
前
ト
？
ｏ
手
ほ
フ
ク
日
気
何
-
来
上
0
時
テ
4
行
シ
私
ッ
薫
二
名
間
云
方
！
中
下
男
小
大
1
目
身
≫
≪
生
ァ
：
/
屋
ネ
入
知
ょ
ヌ
家
今
ア
事
無
2
卿
話
む
立
三
年
本
イ
々
心
部
ラ
由
度
・
タ
ャ
奏
ぬ
様
口
長
顔
初
笑
合
ハ
葉
物
音
少
十
次
当
声
同
後
感
聞
持
者
衛
カ
姉
体
白
兵
エ
会
愛
面
マ
佳
意
色
考
9
3
木
明
投
.
理
里
向
馬
:
通
ヘ
助
好
取
最
着
真
レ
込
居
処
味
稿
場
不
情
仕
コ
ロ
楽
実
娘
学
ゆ
夜
相
的
然
r
君
島
返
動
m
付
ヒ
（
対
）
守
先
近
外
良
郎
用
書
ケ
電
車
所
足
変
打
起
掛
内
枝
之
7
食
呼
待
庭
以
引
首
5
風
ホ
張
此
メ
ウ
違
井
>
置
頭
室
解
世
別
月
黒
切
力
姿
代
新
茶
太
田
受
要
可
四
門
腰
左
両
8
誰
ゐ
問
帰
土
恋
地
キ
悪
水
歩
宮
鞭
若
服
親
ナ
神
寝
多
他
唐
九
光
全
苦
主
『
姫
美
』
敷
答
七
犬
文
腹
台
毛
直
落
高
作
道
語
定
突
命
連
五
必
h
正
緒
役
信
ゝ
指
表
6
戸
結
細
サ
教
石
金
師
セ
望
眼
但
想
g
元
重
関
開
環
ワ
八
性
押
徒
使
赤
腕
皮
説
e
髪
為
現
其
早
申
天
花
放
流
チ
源
数
壁
確
側
発
死
半
乳
似
青
響
始
寄
母
微
老
胸
s
段
院
町
達
霊
化
座
優
貴
消
黙
!
房
調
終
抱
配
種
鎖
／
残
朝
＼
鉄
平
決
鳴
a
態
去
振
夫
モ
告
山
ニ
江
我
過
強
オ
火
婦
裸
肉
有
静
令
ツ
送
膝
恐
ム
殿
万
空
妙
息
背
在
回
乗
驚
清
唇
ィ
急
素
椅
伝
存
━
止
加
紅
番
輪
殺
装
形
得
異
浮
玉
示
瞬
軽
)
(
聖
質
果
床
脚
穂
住
暗
買
瑞
絶
遊
松
従
失
安
字
国
深
ュ
求
売
横
格
冷
快
斯
成
奥
接
寮
御
許
奇
議
題
奴
u
覚
友
視
反
経
欲
肩
撫
校
階
伊
念
忘
困
右
舞
草
k
遠
紙
等
ぁ
論
渡
法
t
菊
窓
活
唯
頃
業
o
衣
線
離
途
皆
判
y
記
和
容
工
ョ
状
続
隠
集
満
雪
余
東
並
鏡
傷
灯
海
根
昼
妹
閉
降
岡
ソ
桜
職
晩
裏
予
点
古
義
飛
構
縫
建
縁
仰
抜
夢
利
例
p
員
薄
願
運
了
客
堂
供
怪
千
原
断
共
単
村
第
機
期
証
泣
f
談
独
吉
品
詰
縛
野
店
惑
毎
奈
戻
追
選
束
昨
刻
六
熱
百
邸
飲
折
路
端
係
沈
曲
図
認
礼
片
公
読
茉
程
角
界
器
悲
鼠
締
応
ミ
嬉
注
際
組
式
ォ
庫
具
ェ
支
痛
焼
ヤ
末
幸
◆
喜
迎
勝
頼
勢
ノ
忍
興
耳
箱
i
参
陽
遅
?
巻
看
紫
普
円
演
川
負
乃
留
靴
敵
浴
故
香
印
弟
周
倒
ﾟ
難
眺
恥
甲
位
常
俺
寸
柄
狂
夕
ﾞ
鳥
腿
柱
銭
士
逆
広
限
報
婆
丁
遣
芸
矢
祈
京
更
底
走
席
像
慣
特
計
照
秘
完
隷
差
谷
仮
w
〜
散
脱
※
料
頂
嬢
与
拝
制
固
貰
丸
幾
仲
承
梅
転
怖
岩
館
影
破
剣
社
園
紀
観
血
苑
炉
秋
辞
吻
肌
厳
叫
崇
逢
非
綱
廊
福
類
伏
宿
劇
嫌
父
蛇
囲
象
噂
涙
雨
緑
官
則
氏
探
骨
c
枕
罪
露
精
頑
粧
燃
n
或
挨
珍
魔
越
済
逃
暴
暮
密
約
識
頬
団
扉
迷
映
午
務
商
堪
任
爺
拶
句
週
票
´
案
甘
交
煖
訳
触
灰
割
号
画
短
随
丈
及
紐
歳
弱
踊
猫
描
造
黄
否
跡
疑
能
｀
権
低
布
絹
|
又
労
匠
験
肘
罰
勿
凄
麦
撃
訊
互
拠
写
ゅ
効
保
就
個
奉
易
城
層
吹
畳
眠
吐
儀
隣
羽
卒
袋
休
傍
察
辺
祭
應
設
刺
ヨ
屈
街
移
浅
乱
咲
筋
謝
模
技
捨
船
嘘
景
育
斎
危
局
復
吸
春
件
登
挙
襲
￣
進
沙
介
規
棚
廟
病
混
厚
舌
荒
d
樹
華
簡
鍵
塗
呆
机
譲
順
闇
犯
巫
輝
総
帯
洗
坐
防
麗
星
惚
襟
蕎
基
寒
筈
匂
泉
那
責
尻
慎
占
芝
毒
枚
暫
揺
壇
波
幽
湯
歌
憎
袖
踏
激
ユ
派
酒
習
冑
淹
詩
鼻
j
除
市
柔
･
敬
河
杯
誘
継
節
抗
貞
眉
祷
臀
織
届
×
働
板
宅
純
匹
絵
凝
険
飯
騒
震
堅
刀
量
哀
志
洋
綺
亭
趣
廻
飾
温
級
駄
慢
玄
戦
寂
執
養
棟
評
輩
久
救
染
傾
脇
境
再
貌
拷
尽
籠
編
烈
ﾉ
晴
旦
備
英
─
才
痕
討
帳
歓
努
鋭
錠
退
岸
偶
怒
未
透
梁
汗
塔
幼
煙
扱
伸
絨
辱
毯
悩
夏
翌
委
惜
属
減
疲
包
_
寺
族
雑
王
乎
墓
艶
厭
都
臣
極
沢
積
魂
治
提
歴
候
因
隅
鹿
棄
紹
整
版
猿
将
納
荷
銀
訪
暇
ﾀ
蝋
尾
避
溜
狭
砂
慮
燭
陸
据
雲
幕
些
ｷ
牌
永
繰
比
西
歯
試
緊
濃
北
瞳
誇
筆
借
護
懐
弁
邪
憐
熊
司
貫
握
林
鐘
条
政
修
裂
粉
淡
揚
陰
兄
油
蔵
悔
酷
遂
禁
叩
橋
僧
科
寧
型
迫
補
善
ｶ
憶
棒
卓
汚
釈
拾
碗
武
杜
∀
控
−
替
勇
勤
銅
箪
酔
致
障
払
茂
○
干
練
適
博
招
愚
裕
己
壊
給
勘
軍
郷
l
ｳ
ｰ
捕
朱
速
尊
嫉
笥
披
舎
釘
窪
亡
昔
盛
＿
駆
術
妻
泊
尋
莫
区
蝶
ｱ
掌
便
'
児
竦
胆
妬
添
欠
額
蓋
準
蔑
痣
彫
`
戯
肯
森
架
嫁
覗
慌
愉
測
課
抵
巨
冬
倉
改
召
糸
烙
籍
櫻
汐
巧
旅
冗
霧
講
屹
坂
刷
闘
副
僅
勧
到
２
詣
癖
ｸ
裾
孔
〇
如
築
喉
胴
屡
湿
贈
坊
収
睨
是
沿
往
乞
漏
崩
茫
述
馴
隙
x
魚
掘
竹
僕
諾
‐
｡
尤
雅
ｃ
般
侮
衆
臭
零
耐
宗
既
昭
忙
ｪ
詳
亦
喧
懸
列
拒
埋
省
ヶ
序
蔭
免
饗
況
範
植
掻
各
硬
宜
豪
領
警
恨
侵
監
民
粋
依
猶
拵
至
騎
膚
皺
仏
蹴
讐
宝
南
幅
斜
阪
拗
緩
敗
称
筒
斬
盤
換
薪
章
雄
暖
ﾌ
遺
嘩
双
暑
滅
拡
聴
製
羨
駅
貧
覧
溢
没
弾
推
史
弄
揃
棺
奮
捜
携
桂
偽
肝
兎
怨
狙
衝
産
尚
敢
鋼
曾
札
智
希
巡
吊
ｗ
悟
亀
畜
獲
辛
璃
算
索
獄
踵
械
楓
綿
管
】
稽
薬
賑
仙
躇
１
姓
淫
躊
【
呻
菅
穏
秒
滑
翼
櫛
呂
米
穴
施
宣
濡
攻
央
柳
妄
導
曜
賭
珠
z
協
宵
競
祠
ａ
鬼
炎
縮
卑
噴
盗
叛
奔
超
尺
蚊
刃
狐
狩
爆
誉
埃
几
呪
ｈ
宙
伴
彩
虚
盾
洩
氷
陳
汰
雰
射
率
誤
栄
浄
裁
貸
繁
威
湧
咽
槍
馳
縄
赦
被
玻
妖
褒
畢
裳
憧
塵
鎧
枯
ｼ
麻
豊
促
塀
催
冊
旋
徴
履
庶
蒲
鈴
忠
鮮
烏
\
睫
漂
猛
遁
吟
琴
謎
嘲
掃
斐
眸
宇
痩
鬱
拭
俄
把
麿
葬
股
蹟
幻
苛
狼
泥
呑
熟
督
鏝
襖
旗
害
謹
喩
戒
ﾄ
費
冴
誕
翳
資
砕
充
徹
倍
軒
浪
津
富
系
営
於
娼
鈍
閃
耽
ぇ
盲
焦
昇
梢
虐
溝
爪
球
ぉ
v
援
脳
鉤
躍
徳
袢
恰
崎
剥
停
損
渦
骸
箸
繻
→
旧
孤
凶
慕
ｋ
瓶
潮
溶
棲
祝
還
材
抽
伺
餅
遭
溺
叶
斥
怠
ヽ
飽
嬶
牛
獣
磨
噛
幹
袂
繋
欺
沼
統
愕
俗
瀬
挟
魅
妾
較
含
⌒
套
抑
襞
擦
惨
ｐ
帽
ﾙ
諦
誓
瞥
祖
鉢
附
剃
慨
盆
垂
奪
橘
医
喰
潔
仇
増
圧
襦
塩
捉
敏
ヵ
銘
隔
叔
瞼
検
腋
針
功
矛
殊
標
縞
滞
訓
遇
符
忽
澄
仁
ぅ
秀
堕
浸
摘
冠
肢
蒼
巣
=
載
腐
覆
婚
琥
燈
専
阿
匍
頓
*
汽
泳
距
苔
啜
佐
健
蒸
甥
粗
荘
賞
ｂ
摂
暈
釣
農
液
裡
顧
涯
礁
臆
３
審
値
泡
徐
洲
唾
捲
駿
罵
珀
謀
檻
戴
詫
授
紋
傘
誌
憂
捻
嘆
勃
託
撮
陶
駈
慈
傲
齢
吾
乙
凡
逝
慶
咎
藁
挑
慰
蓮
癒
鯉
拍
悠
孫
岬
乏
乾
詞
慧
脅
囚
胼
ﾝ
漬
康
謙
牢
稚
←
竜
貨
垣
瞑
朧
恩
翻
糖
愍
綻
均
複
俊
炊
賛
喋
眩
俯
池
羊
紛
牲
粒
凜
唸
欧
犠
ｓ
曖
胝
概
略
戍
却
這
戌
臥
稲
竿
粂
升
延
芽
奢
笞
掉
預
ｇ
財
争
ﾊ
歪
д
駒
脈
丹
爽
ｽ
ｻ
飼
漸
兼
迦
呟
季
藩
渋
讃
舗
隈
恍
奕
昧
企
錯
只
傭
虫
茅
訴
屍
凌
諸
価
絡
霞
忌
殻
嵩
衾
策
妓
″
褐
漢
悄
采
潤
暢
圃
狽
涜
簾
嵐
笛
潟
紗
髭
佇
萎
顰
ﾚ
操
髯
廓
藤
蛮
潜
皿
穢
孕
喫
逡
劣
即
蛾
鷹
辻
癪
刑
頸
ｒ
ｴ
丘
岐
頻
鍋
喪
刊
螺
旨
蠣
雫
雷
怯
鍛
陣
桃
妨
帝
慟
歎
府
也
択
隆
憚
０
繊
爵
斧
鷺
曇
批
輯
硝
宛
展
塞
斗
詮
濁
喘
吠
廃
廿
浜
曳
贅
鼓
ω
睡
寛
祟
駕
群
薦
窩
募
ｄ
ｧ
慄
雛
叱
牧
拘
蛸
龍
滴
謂
喝
煎
傑
丞
婿
勉
鎌
處
欄
汲
嵌
暁
訣
併
捧
州
逐
斑
呶
哭
纏
b
菜
蓄
賃
臨
請
揮
録
凭
鑑
醜
膳
嗜
閣
芥
踝
彷
枠
莟
坪
拙
慇
〕
伯
阜
肥
縦
泰
迂
魄
唄
扮
夙
跳
粘
衡
ﾏ
楯
融
禿
鞘
錘
顕
辿
緬
徨
嘔
炭
酸
摺
龕
糊
尖
袴
ｲ
舟
仔
呈
胡
黐
懲
潰
漁
肖
堤
杉
棋
戚
痴
５
庄
ｙ
懺
封
逸
賽
販
殉
滝
槌
沖
梯
ｘ
禽
茨
詈
刈
錦
哲
；
汝
疫
懃
宴
典
遜
４
匐
糞
粛
綾
刹
朽
漠
遮
逞
揉
陥
槃
涅
ｅ
ｕ
恵
涸
厄
杏
颯
剪
尼
姥
冶
＊
廂
網
創
稍
〔
碌
究
析
髄
綴
査
寿
懶
ｖ
啼
鳶
寡
燕
湛
竝
閑
ｔ
欖
蜜
衰
懇
紡
豆
項
ｯ
斉
泪
＋
墨
毀
瑕
憫
芳
唱
弥
杖
框
瓦
伎
偉
屓
沫
穫
窮
燥
洞
藻
脂
驢
昏
鋏
埒
楚
律
殆
臍
賢
研
諭
償
蒐
桶
肚
絞
畏
ﾒ
愈
梳
橄
晦
８
盃
贔
酉
緋
禄
磐
啓
柏
ｍ
ゥ
袷
醒
婪
悦
幟
伐
ｮ
鞄
茹
柵
漆
欽
猟
洒
炯
巾
稀
苺
彦
雀
辰
槽
做
鶏
閨
涼
誠
絆
賄
朔
蜀
壮
懼
焉
歿
沸
箔
拳
鈿
;
錆
谺
偏
喚
轄
ｵ
饒
烟
耶
娠
鳩
屁
∧
６
簀
躾
＞
厨
壺
窺
蕾
賊
躙
鴉
攣
侯
痙
拉
蹂
峠
竟
垢
嗚
庚
楼
浬
苗
缶
董
腑
窟
著
株
埴
繩
脣
塚
畑
ｆ
函
゜
牡
昆
葱
輻
嫡
ﾜ
擽
栗
悶
須
+
跪
緞
殖
瑯
髷
儘
澁
ﾁ
△
煮
杢
匿
頤
癇
疾
嬌
臈
菓
q
＆
焚
冒
玩
鷲
燧
淵
賂
ｊ
益
儚
肱
猥
軸
侍
嘗
灼
朶
惰
琺
渉
拱
鎮
享
蝕
擬
掲
摩
辟
匕
嚇
ﾎ
姐
籤
顳
削
ｫ
掩
諫
甦
朴
膜
棠
錬
濯
脛
誂
棹
弛
禅
妊
ヲ
叙
貪
靭
ﾍ
鑿
甚
厠
藉
鬘
哉
剌
繍
駐
蹙
繕
囮
虎
遍
悉
釜
壬
貯
轢
羞
畠
憤
靄
鑢
撲
毅
党
廉
璧
灘
妥
澤
疎
契
襠
担
溌
昌
梵
恒
騙
而
擁
截
杞
蒙
薙
腫
捏
湖
殴
欝
曰
峙
瞭
姪
９
儲
孜
俳
掟
〈
贋
僚
伜
趺
絣
蛙
蟇
吝
燠
隊
祀
ｨ
掴
泌
堝
縊
訝
貝
慥
虞
吃
叭
姦
虹
逓
櫓
漫
ﾘ
贖
咄
仄
葦
童
荊
隘
韜
慴
熨
旬
魎
嬪
鶯
睦
ﾗ
誼
菌
蜂
鴿
銚
兌
巌
嬲
且
逼
塒
抹
陀
署
崖
翁
蝉
腔
倶
錚
燐
註
腮
］
侠
征
笠
撓
臼
聳
雌
鍜
楕
洪
糢
〉
剖
ﾃ
瑚
縒
曝
桐
笹
莨
ﾅ
採
維
捷
紳
蜘
膨
＝
鏑
弘
棘
倦
嶺
褪
~
酬
瘉
瓢
郭
濶
飴
瓜
搗
咏
犇
療
,
仆
狛
餌
厩
栃
蘭
醇
榎
蕩
酌
陋
薩
蝟
鄙
姑
謡
踉
ｭ
ﾛ
紺
李
勲
葵
撒
沓
蟻
罠
諜
ﾔ
幡
賺
揄
庇
櫃
稼
珈
慍
晒
榴
♪
診
茎
尠
褄
鞋
堰
臙
郁
葛
賀
綜
臓
珊
籬
圭
柊
狗
癩
涎
&
嫩
擲
顛
巳
咳
脆
苟
宥
吼
矮
遥
掠
貶
菩
]
鰭
菫
諳
緘
吏
暦
盒
励
ｌ
萬
汁
衷
薔
畔
魍
戟
崗
硫
韓
革
鑞
叉
嫖
琉
氾
葡
蔽
蛤
痺
憬
該
筮
尿
累
糧
轤
∵
纒
捫
ぃ
蕀
蓉
寵
后
桟
爬
淑
婉
晋
蝗
駁
購
阻
焜
症
靡
宏
賤
莱
焔
軈
楊
咀
菰
袍
罹
椿
鱈
ｹ
肴
遽
牝
甕
闊
克
裃
彎
郊
硯
籐
跣
楸
眷
萄
婢
芦
慾
藪
ﾑ
訂
渾
狡
鴨
桔
誦
遡
撚
躯
搬
鋲
壜
偵
譚
軋
堵
篤
熾
窶
瑠
閲
鴻
奨
勾
脊
昂
恃
堀
牀
播
飜
磯
班
佗
貼
ｬ
碑
諏
潭
簪
喇
伍
卦
域
侘
牙
噪
糾
寥
胎
弓
蛛
狸
朦
丑
篇
恫
轆
献
韻
憑
攫
枷
緯
堊
膕
茸
ヰ
悧
窘
虔
撤
盥
鼈
[
鉱
孝
践
倣
峰
毳
齧
葭
箋
朗
虜
嚼
賓
坩
柴
柿
邑
屠
鴟
蹌
琲
航
芻
煩
ｦ
秤
蟄
諺
醸
σ
礎
謐
顎
秩
舷
揶
鮨
萌
黴
薇
奸
糜
帷
幌
ﾂ
艸
稔
壷
轟
７
箇
鹸
霹
筑
俸
郵
卵
皇
靂
弦
鉛
鰓
碓
簫
禍
漲
ｿ
芒
嗟
濫
巴
迅
ﾋ
凹
撻
已
某
柘
謫
汀
椀
惹
筌
邦
啄
ｺ
措
蘇
